# from states import *

# from aiogram import types
from icecream import ic


class UserText:
    def __init__(self):
        self._stock = {
            "start_message": (
                "Привіт, це Бот Кулінарної Студії Гастролофт\n"
                "Я допоможу тобі:\n"
                "• отримати рецепти після твоєї події\n"
                "• відправити запит на бронювання події\n"
                "• отримувати нові рецепти та знання з кулінарії від Команди Шеф-Кухарів Гастролофт\n"
                "• бути в курсі останніх подій у Кулінарній студії\n"
                "• переглянути цікаві статті від авторів і Шеф-кухарів\n"
                "• у разі питань - швидко зв’яжу з нашим адміністратором студії\n"
                "прийму ваш щирий та чесний відгук про ваш захід і нашу студію, щоб в наступний раз ми були якомога ближче до “10 з 10”\n"
            ),
            "choose_option_to_continue": "Для того щоб продовжити виберіть із меню наступну дію:",
            "enter_date": "Введіть дату формату дд/мм/рррр",
            "when_event_happened": "Коли ця подія відбулася: вдень чи ввечері?",
            "food_was_then": "Їжа, яка була того дня:\n{food}",
            "send_form": "Відправте мені дані по наступному шаблону",
            "change_form": (
                "Ім'я: <b>{name}</b>\n"
                "Телефон: <b>{phone}</b>\n"
                "Подія(Корпоратив,Весілля,День Народження/Інші варіанти): <b>{action}</b>\n"
                "Кількість людей: <b>{num_of_people}</b>\n"
                "Бажана дата: <b>{desired_date}</b>\n"
            ),
            "change_form_state": {
                "name": "Введіть ім'я:",
                "phone": "Введіть телефон:",
                "action": "Введіть назву події:",
                "num_of_people": "Введіть кількість людей:",
                "desired_date": "Введіть бажану дату (формат дд.мм.рррр):",
            },
            "should_we_send_form": "Натисніть кнопку нижче, щоб відправити запит.",
            "form_sent": "Запит успішно надіслано.",
        }

    async def get_text(self, key: str | None = None, **kwargs):
        return self._stock.get(key).format(**kwargs)
