class UserText:
    MESSAGES = {
        "start_message": (
            "Привіт, це Бот Кулінарної Студії Гастролофт\n"
            "Я допоможу тобі:\n"
            "• отримати рецепти після твоєї події\n"
            "• відправити запит на бронювання події\n"
            "• отримувати нові рецепти та знання з кулінарії від Команди Шеф-Кухарів Гастролофт\n"
            "• бути в курсі останніх подій у Кулінарній студії\n"
            "• переглянути цікаві статті від авторів і Шеф-кухарів\n"
            "• у разі питань - швидко зв’яжу з нашим адміністратором студії\n"
            "прийму ваш щирий та чесний відгук про ваш захід і нашу студію, щоб в наступний раз ми були якомога ближче до “10 з 10”\n"
        ),
        "choose_option_to_continue": "Для того щоб продовжити виберіть із меню наступну дію:",
    }

    def __init__(self):
        self.stock = UserText.MESSAGES
